Revit 2027 API
SplitButtonData Class
This class contains information necessary to construct a split button in the Ribbon.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.ItemData
 Autodesk.Revit.UI.RibbonItemData
 Autodesk.Revit.UI.ButtonData
 Autodesk.Revit.UI.PulldownButtonData
 Autodesk.Revit.UI.SplitButtonData
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class SplitButtonData : PulldownButtonData
Public Class SplitButtonData
	Inherits PulldownButtonData
public ref class SplitButtonData : public PulldownButtonData
type SplitButtonData =
    class
        inherit PulldownButtonData
    end
The SplitButtonData type exposes the following members.
Constructors
Name | Description
SplitButtonData | Constructs a new instance of SplitButtonData.
Top
Properties
Name | Description
Image | The image of the button.
(Inherited from ButtonData)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ItemData)
LargeImage | The large image of the button.
(Inherited from ButtonData)
LongDescription |  Long description of the command tooltip
(Inherited from RibbonItemData)
Name |  The internal name of the item.
(Inherited from ItemData)
Text | The user-visible text of the button.
(Inherited from ButtonData)
ToolTip |  The tooltip of item.
(Inherited from ItemData)
ToolTipImage | The image to show as a part of the button extended tooltip
(Inherited from RibbonItemData)
Top
Methods
Name | Description
Dispose
(Inherited from ItemData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetContextualHelp | Gets the contextual help bound with this control.
(Inherited from RibbonItemData)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetContextualHelp | Sets the contextual help bound with this button data.
(Inherited from RibbonItemData)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.UI Namespace